```bash: LOF
(venv) user@user:~/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data$  cd /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data ; /usr/bin/env /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/venv/bin/python /home/user/.vscode/extensions/ms-python.debugpy-2024.13.2024103001-linux-x64/bundled/libs/debugpy/adapter/../../debugpy/launcher 54385 -- LOF_Outlier_Detection.py /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/ 
元のmodel_dataの形状: (110, 1, 512)
修正後のmodel_dataの形状: (110, 512)
正規化前のデータの最大値: 7.992140293121338, 最小値: -8.26479434967041
正規化後のデータの最大値: 0.18281598389148712, 最小値: -0.1682458519935608
元のmodel_dataの形状: (110, 1, 512)
修正後のmodel_dataの形状: (110, 512)
正規化前のデータの最大値: 7.992140293121338, 最小値: -8.26479434967041
正規化後のデータの最大値: 0.18281598389148712, 最小値: -0.1682458519935608
データ数: 220
LOFによる外れ値検出を行います。
LOFスコアの最大値: 1.7416493892669678, 最小値: 0.9630197286605835
外れ値検出: 名前: 杏野なつ_vTLd...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.7416
外れ値検出: 名前: 杏野なつ_Hi1w...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.6756
外れ値検出: 名前: 杏野なつ_rseU...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.5488
外れ値検出: 名前: 杏野なつ_3N50...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.5478
外れ値検出: 名前: 杏野なつ_oeWz.png_.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.6272
外れ値検出: 名前: 杏野なつ_dytf.jpg...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.6574
外れ値検出: 名前: 杏野なつ_g7De.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.5043
外れ値検出: 名前: 杏野なつ_oj1I.jpg.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, LOFスコア: 1.5366
外れ値検出: 名前: 杏野なつ_vTLd...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.7416
外れ値検出: 名前: 杏野なつ_Hi1w...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.6756
外れ値検出: 名前: 杏野なつ_rseU...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.5488
外れ値検出: 名前: 杏野なつ_3N50...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.5478
外れ値検出: 名前: 杏野なつ_oeWz.png_.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.6272
外れ値検出: 名前: 杏野なつ_dytf.jpg...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.6574
外れ値検出: 名前: 杏野なつ_g7De.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.5043
外れ値検出: 名前: 杏野なつ_oj1I.jpg.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, LOFスコア: 1.5366
処理時間: 0分 0.02秒
```

```bash: Faiss
(venv) user@user:~/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data$  cd /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data ; /usr/bin/env /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/venv/bin/python /home/user/.vscode/extensions/ms-python.debugpy-2024.13.2024103001-linux-x64/bundled/libs/debugpy/adapter/../../debugpy/launcher 55185 -- Faiss_Outlier_Detection.py /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/ 
元のmodel_dataの形状: (110, 1, 512)
修正後のmodel_dataの形状: (110, 512)
正規化前のデータの最大値: 7.992140293121338, 最小値: -8.26479434967041
正規化後のデータの最大値: 0.18281598389148712, 最小値: -0.1682458519935608
元のmodel_dataの形状: (110, 1, 512)
修正後のmodel_dataの形状: (110, 512)
正規化前のデータの最大値: 7.992140293121338, 最小値: -8.26479434967041
正規化後のデータの最大値: 0.18281598389148712, 最小値: -0.1682458519935608
データ数: 220
IndexFlatIPを使用します。
D の最大値: 1.0000004768371582, 最小値: 0.2797895669937134
データインデックス 0 の平均類似度: 0.7918953895568848
データインデックス 1 の平均類似度: 0.4261559247970581
データインデックス 2 の平均類似度: 0.6147749423980713
データインデックス 3 の平均類似度: 0.6082427501678467
データインデックス 4 の平均類似度: 0.7487795948982239
データインデックス 5 の平均類似度: 0.694920539855957
データインデックス 6 の平均類似度: 0.7786003351211548
データインデックス 7 の平均類似度: 0.6303556561470032
データインデックス 8 の平均類似度: 0.821970522403717
データインデックス 9 の平均類似度: 0.6149818897247314
データインデックス 10 の平均類似度: 0.6178918480873108
データインデックス 11 の平均類似度: 0.7964746952056885
データインデックス 12 の平均類似度: 0.7397475242614746
データインデックス 13 の平均類似度: 0.8667787909507751
データインデックス 14 の平均類似度: 0.8249218463897705
データインデックス 15 の平均類似度: 0.8326156139373779
データインデックス 16 の平均類似度: 0.6578754186630249
データインデックス 17 の平均類似度: 0.6101329326629639
データインデックス 18 の平均類似度: 0.6081051230430603
データインデックス 19 の平均類似度: 0.4562290906906128
データインデックス 20 の平均類似度: 0.6112182140350342
データインデックス 21 の平均類似度: 0.7605451941490173
データインデックス 22 の平均類似度: 0.5164021253585815
データインデックス 23 の平均類似度: 0.8218968510627747
データインデックス 24 の平均類似度: 0.6906058192253113
データインデックス 25 の平均類似度: 0.7478897571563721
データインデックス 26 の平均類似度: 0.7110787630081177
データインデックス 27 の平均類似度: 0.4719024896621704
データインデックス 28 の平均類似度: 0.6576550602912903
データインデックス 29 の平均類似度: 0.8635281920433044
データインデックス 30 の平均類似度: 0.5196987986564636
データインデックス 31 の平均類似度: 0.8170948624610901
データインデックス 32 の平均類似度: 0.8219999670982361
データインデックス 33 の平均類似度: 0.4926353991031647
データインデックス 34 の平均類似度: 0.78750079870224
データインデックス 35 の平均類似度: 0.7522506713867188
データインデックス 36 の平均類似度: 0.8162343502044678
データインデックス 37 の平均類似度: 0.8209616541862488
データインデックス 38 の平均類似度: 0.76569664478302
データインデックス 39 の平均類似度: 0.720834493637085
データインデックス 40 の平均類似度: 0.733851969242096
データインデックス 41 の平均類似度: 0.8084099292755127
データインデックス 42 の平均類似度: 0.6715655326843262
データインデックス 43 の平均類似度: 0.4477945566177368
データインデックス 44 の平均類似度: 0.8111797571182251
データインデックス 45 の平均類似度: 0.7182780504226685
データインデックス 46 の平均類似度: 0.703317403793335
データインデックス 47 の平均類似度: 0.5817767381668091
データインデックス 48 の平均類似度: 0.5728709697723389
データインデックス 49 の平均類似度: 0.555196225643158
データインデックス 50 の平均類似度: 0.5638258457183838
データインデックス 51 の平均類似度: 0.6909040212631226
データインデックス 52 の平均類似度: 0.6829615235328674
データインデックス 53 の平均類似度: 0.7187103033065796
データインデックス 54 の平均類似度: 0.8287304639816284
データインデックス 55 の平均類似度: 0.8671773076057434
データインデックス 56 の平均類似度: 0.7005293965339661
データインデックス 57 の平均類似度: 0.7179514765739441
データインデックス 58 の平均類似度: 0.6418496370315552
データインデックス 59 の平均類似度: 0.6145823001861572
データインデックス 60 の平均類似度: 0.8239985704421997
データインデックス 61 の平均類似度: 0.6378905773162842
データインデックス 62 の平均類似度: 0.8477985858917236
データインデックス 63 の平均類似度: 0.7848680019378662
データインデックス 64 の平均類似度: 0.8343005180358887
データインデックス 65 の平均類似度: 0.592782199382782
データインデックス 66 の平均類似度: 0.5983401536941528
データインデックス 67 の平均類似度: 0.6216831207275391
データインデックス 68 の平均類似度: 0.828765869140625
データインデックス 69 の平均類似度: 0.6899116635322571
データインデックス 70 の平均類似度: 0.8196012377738953
データインデックス 71 の平均類似度: 0.5584060549736023
データインデックス 72 の平均類似度: 0.7484970092773438
データインデックス 73 の平均類似度: 0.6677415370941162
データインデックス 74 の平均類似度: 0.8557435870170593
データインデックス 75 の平均類似度: 0.875469446182251
データインデックス 76 の平均類似度: 0.7164084911346436
データインデックス 77 の平均類似度: 0.5248497724533081
データインデックス 78 の平均類似度: 0.7840972542762756
データインデックス 79 の平均類似度: 0.6984022259712219
データインデックス 80 の平均類似度: 0.7270694375038147
データインデックス 81 の平均類似度: 0.823328971862793
データインデックス 82 の平均類似度: 0.6468106508255005
データインデックス 83 の平均類似度: 0.8633018136024475
データインデックス 84 の平均類似度: 0.8101818561553955
データインデックス 85 の平均類似度: 0.812397301197052
データインデックス 86 の平均類似度: 0.45192793011665344
データインデックス 87 の平均類似度: 0.6781938672065735
データインデックス 88 の平均類似度: 0.5879265666007996
データインデックス 89 の平均類似度: 0.8524244427680969
データインデックス 90 の平均類似度: 0.6806932091712952
データインデックス 91 の平均類似度: 0.7757384777069092
データインデックス 92 の平均類似度: 0.8992748260498047
データインデックス 93 の平均類似度: 0.6525753140449524
データインデックス 94 の平均類似度: 0.6970060467720032
データインデックス 95 の平均類似度: 0.7300035953521729
データインデックス 96 の平均類似度: 0.5505770444869995
データインデックス 97 の平均類似度: 0.8760078549385071
データインデックス 98 の平均類似度: 0.5781132578849792
データインデックス 99 の平均類似度: 0.8566900491714478
データインデックス 100 の平均類似度: 0.7370878458023071
データインデックス 101 の平均類似度: 0.7980899810791016
データインデックス 102 の平均類似度: 0.5860636830329895
データインデックス 103 の平均類似度: 0.5585588812828064
データインデックス 104 の平均類似度: 0.519532322883606
データインデックス 105 の平均類似度: 0.55918949842453
データインデックス 106 の平均類似度: 0.8191695809364319
データインデックス 107 の平均類似度: 0.6065080165863037
データインデックス 108 の平均類似度: 0.8961184620857239
データインデックス 109 の平均類似度: 0.8650777339935303
データインデックス 110 の平均類似度: 0.7918953895568848
データインデックス 111 の平均類似度: 0.4261559247970581
データインデックス 112 の平均類似度: 0.6147749423980713
データインデックス 113 の平均類似度: 0.6082427501678467
データインデックス 114 の平均類似度: 0.7487795948982239
データインデックス 115 の平均類似度: 0.694920539855957
データインデックス 116 の平均類似度: 0.7786003351211548
データインデックス 117 の平均類似度: 0.6303556561470032
データインデックス 118 の平均類似度: 0.821970522403717
データインデックス 119 の平均類似度: 0.6149818897247314
データインデックス 120 の平均類似度: 0.6178918480873108
データインデックス 121 の平均類似度: 0.7964746952056885
データインデックス 122 の平均類似度: 0.7397475242614746
データインデックス 123 の平均類似度: 0.8667787909507751
データインデックス 124 の平均類似度: 0.8249218463897705
データインデックス 125 の平均類似度: 0.8326156139373779
データインデックス 126 の平均類似度: 0.6578754186630249
データインデックス 127 の平均類似度: 0.6101329326629639
データインデックス 128 の平均類似度: 0.6081051230430603
データインデックス 129 の平均類似度: 0.4562290906906128
データインデックス 130 の平均類似度: 0.6112182140350342
データインデックス 131 の平均類似度: 0.7605451941490173
データインデックス 132 の平均類似度: 0.5164021253585815
データインデックス 133 の平均類似度: 0.8218968510627747
データインデックス 134 の平均類似度: 0.6906058192253113
データインデックス 135 の平均類似度: 0.7478897571563721
データインデックス 136 の平均類似度: 0.7110787630081177
データインデックス 137 の平均類似度: 0.4719024896621704
データインデックス 138 の平均類似度: 0.6576550602912903
データインデックス 139 の平均類似度: 0.8635281920433044
データインデックス 140 の平均類似度: 0.5196987986564636
データインデックス 141 の平均類似度: 0.8170948624610901
データインデックス 142 の平均類似度: 0.8219999670982361
データインデックス 143 の平均類似度: 0.4926353991031647
データインデックス 144 の平均類似度: 0.78750079870224
データインデックス 145 の平均類似度: 0.7522506713867188
データインデックス 146 の平均類似度: 0.8162343502044678
データインデックス 147 の平均類似度: 0.8209616541862488
データインデックス 148 の平均類似度: 0.76569664478302
データインデックス 149 の平均類似度: 0.720834493637085
データインデックス 150 の平均類似度: 0.733851969242096
データインデックス 151 の平均類似度: 0.8084099292755127
データインデックス 152 の平均類似度: 0.6715655326843262
データインデックス 153 の平均類似度: 0.4477945566177368
データインデックス 154 の平均類似度: 0.8111797571182251
データインデックス 155 の平均類似度: 0.7182780504226685
データインデックス 156 の平均類似度: 0.703317403793335
データインデックス 157 の平均類似度: 0.5817767381668091
データインデックス 158 の平均類似度: 0.5728709697723389
データインデックス 159 の平均類似度: 0.555196225643158
データインデックス 160 の平均類似度: 0.5638258457183838
データインデックス 161 の平均類似度: 0.6909040212631226
データインデックス 162 の平均類似度: 0.6829615235328674
データインデックス 163 の平均類似度: 0.7187103033065796
データインデックス 164 の平均類似度: 0.8287304639816284
データインデックス 165 の平均類似度: 0.8671773076057434
データインデックス 166 の平均類似度: 0.7005293965339661
データインデックス 167 の平均類似度: 0.7179514765739441
データインデックス 168 の平均類似度: 0.6418496370315552
データインデックス 169 の平均類似度: 0.6145823001861572
データインデックス 170 の平均類似度: 0.8239985704421997
データインデックス 171 の平均類似度: 0.6378905773162842
データインデックス 172 の平均類似度: 0.8477985858917236
データインデックス 173 の平均類似度: 0.7848680019378662
データインデックス 174 の平均類似度: 0.8343005180358887
データインデックス 175 の平均類似度: 0.592782199382782
データインデックス 176 の平均類似度: 0.5983401536941528
データインデックス 177 の平均類似度: 0.6216831207275391
データインデックス 178 の平均類似度: 0.828765869140625
データインデックス 179 の平均類似度: 0.6899116635322571
データインデックス 180 の平均類似度: 0.8196012377738953
データインデックス 181 の平均類似度: 0.5584060549736023
データインデックス 182 の平均類似度: 0.7484970092773438
データインデックス 183 の平均類似度: 0.6677415370941162
データインデックス 184 の平均類似度: 0.8557435870170593
データインデックス 185 の平均類似度: 0.875469446182251
データインデックス 186 の平均類似度: 0.7164084911346436
データインデックス 187 の平均類似度: 0.5248497724533081
データインデックス 188 の平均類似度: 0.7840972542762756
データインデックス 189 の平均類似度: 0.6984022259712219
データインデックス 190 の平均類似度: 0.7270694375038147
データインデックス 191 の平均類似度: 0.823328971862793
データインデックス 192 の平均類似度: 0.6468106508255005
データインデックス 193 の平均類似度: 0.8633018136024475
データインデックス 194 の平均類似度: 0.8101818561553955
データインデックス 195 の平均類似度: 0.812397301197052
データインデックス 196 の平均類似度: 0.45192793011665344
データインデックス 197 の平均類似度: 0.6781938672065735
データインデックス 198 の平均類似度: 0.5879265666007996
データインデックス 199 の平均類似度: 0.8524244427680969
データインデックス 200 の平均類似度: 0.6806932091712952
データインデックス 201 の平均類似度: 0.7757384777069092
データインデックス 202 の平均類似度: 0.8992748260498047
データインデックス 203 の平均類似度: 0.6525753140449524
データインデックス 204 の平均類似度: 0.6970060467720032
データインデックス 205 の平均類似度: 0.7300035953521729
データインデックス 206 の平均類似度: 0.5505770444869995
データインデックス 207 の平均類似度: 0.8760078549385071
データインデックス 208 の平均類似度: 0.5781132578849792
データインデックス 209 の平均類似度: 0.8566900491714478
データインデックス 210 の平均類似度: 0.7370878458023071
データインデックス 211 の平均類似度: 0.7980899810791016
データインデックス 212 の平均類似度: 0.5860636830329895
データインデックス 213 の平均類似度: 0.5585588812828064
データインデックス 214 の平均類似度: 0.519532322883606
データインデックス 215 の平均類似度: 0.55918949842453
データインデックス 216 の平均類似度: 0.8191695809364319
データインデックス 217 の平均類似度: 0.6065080165863037
データインデックス 218 の平均類似度: 0.8961184620857239
データインデックス 219 の平均類似度: 0.8650777339935303
外れ値検出: 名前: 杏野なつ_vTLd...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, 平均類似度: 0.4262
外れ値検出: 名前: 杏野なつ_Hi1w...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, 平均類似度: 0.4562
外れ値検出: 名前: 杏野なつ_rseU...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, 平均類似度: 0.4719
外れ値検出: 名前: 杏野なつ_3N50...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, 平均類似度: 0.4926
外れ値検出: 名前: 杏野なつ_GOU0.jpg.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, 平均類似度: 0.4478
外れ値検出: 名前: 杏野なつ_g7De.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/, 平均類似度: 0.4519
外れ値検出: 名前: 杏野なつ_vTLd...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, 平均類似度: 0.4262
外れ値検出: 名前: 杏野なつ_Hi1w...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, 平均類似度: 0.4562
外れ値検出: 名前: 杏野なつ_rseU...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, 平均類似度: 0.4719
外れ値検出: 名前: 杏野なつ_3N50...png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, 平均類似度: 0.4926
外れ値検出: 名前: 杏野なつ_GOU0.jpg.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, 平均類似度: 0.4478
外れ値検出: 名前: 杏野なつ_g7De.png, ディレクトリ: /home/user/ドキュメント/Outlier-Detection-in-Cosine-Similarity-Data/assets/杏野なつ/外れ値ファイル, 平均類似度: 0.4519
処理時間: 0分 0.03秒
```